---
kind: method
id: M:Autodesk.Revit.DB.Electrical.CableTrayConduitBase.IsWithFitting
source: html/09128e30-24fb-5ab5-786a-bb896a0ad757.htm
---
# Autodesk.Revit.DB.Electrical.CableTrayConduitBase.IsWithFitting Method

Return whether its cable tray/conduit type is with fitting

## Syntax (C#)
```csharp
public bool IsWithFitting()
```

## Returns
return true if its type is with fitting type.